Dlubal.RFEM5.NodalSupport
Nodal support parameters

Dlubal.RFEM5.NodalSupport.No
Number

Dlubal.RFEM5.NodalSupport.ID
Identifier

Dlubal.RFEM5.NodalSupport.Comment
Comment

Dlubal.RFEM5.NodalSupport.Tag
Tag

Dlubal.RFEM5.NodalSupport.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.NodalSupport.NodeList
List of nodes supported by this nodal support

Dlubal.RFEM5.NodalSupport.ReferenceSystem
Hinge reference system

Dlubal.RFEM5.NodalSupport.UserDefinedReferenceSystem
User-defined reference system

Dlubal.RFEM5.NodalSupport.IsColumn
Elastic support via column in Z

Dlubal.RFEM5.NodalSupport.Column
Column parameters

Dlubal.RFEM5.NodalSupport.SupportConstantX
Support constant uX'

Dlubal.RFEM5.NodalSupport.SupportConstantY
Support constant uY'

Dlubal.RFEM5.NodalSupport.SupportConstantZ
Support constant uZ'

Dlubal.RFEM5.NodalSupport.RestraintConstantX
Restraint constant φX'

Dlubal.RFEM5.NodalSupport.RestraintConstantY
Restraint constant φY'

Dlubal.RFEM5.NodalSupport.RestraintConstantZ
Restraint constant φZ'

Dlubal.RFEM5.NodalSupport.SupportNonlinearityX
Nonlinearity in uX'

Dlubal.RFEM5.NodalSupport.SupportNonlinearityY
Nonlinearity in uY'

Dlubal.RFEM5.NodalSupport.SupportNonlinearityZ
Nonlinearity in uZ'

Dlubal.RFEM5.NodalSupport.RestraintNonlinearityX
Nonlinearity in φX'

Dlubal.RFEM5.NodalSupport.RestraintNonlinearityY
Nonlinearity in φY'

Dlubal.RFEM5.NodalSupport.RestraintNonlinearityZ
Nonlinearity in φZ'